#language: ru
Функционал: Покупка в интернет магазине

  Сценарий: 1 - Покупка iphone

    * выбран пункт меню "Авторизация"
    * выбираем вход по почте
    * заполняем поле "Почта" значением "kirusha.men@mail.ru"
    * заполняем "Пароль" значением "iq93ee78iq"
    * нажимаем "Войти"

    * вводим в поле "Поиск по Ozon" значение "iphone" и выполняем поиск
    * ограничим "Максимальная цена" до "60000"
    * добавим товары  "В корзину"

    * выбираем пункт  "Корзина"
    * переходим к очистке  Корзины
    * выходим из Аккаунта

    * выполняем Авторизацию
    * вводим в поле "Почта" значение "kirusha.men@mail.ru"
    * вводим в "Пароль" значение "iq93ee78iq"

    * проверяем очистилась ли корзина

  Сценарий: 2 - Покупка беспроводных наушников

    * выбран пункт меню "Авторизация"
    * выбираем вход по почте
    * заполняем поле "Почта" значением "kirusha.men@mail.ru"
    * заполняем "Пароль" значением "iq93ee78iq"
    * нажимаем "Войти"

    * вводим в поле "Поиск по Ozon" значение "наушники" и выполняем поиск
    * ограничим "Максимальная цена" до "10000"
#    * проверяем список брендов
    * добавим товар  "В корзину"

    * выбираем пункт  "Корзина"
    * переходим к очистке  Корзины
    * выходим из Аккаунта

    * выполняем Авторизацию
    * вводим в поле "Почта" значение "kirusha.men@mail.ru"
    * вводим в "Пароль" значение "iq93ee78iq"

    * проверяем очистилась ли корзина









    